[{"user": "Keshav Maheshwari", "title": "Android to Apple Transition - Not a very smooth experience", "star_rating": "4.0 out of 5 stars", "date": "Reviewed in India on 4 February 2023", "message": "This is my first iPhone and it always feels good to hold this masterpiece. This looks premium not just because of its branding, it has everything which makes it feel premium. However, despite all the looks and finish, the transition from Android to Apple is not very smooth and you may constantly lack certain features that can make life easy. I was using Samsung S10 Lite before this and still have that phone with me. Putting out the feature that is being missed by me-1. Forwarding Anything in Whatsapp: Forwarding anything in Whatsapp from IPhone takes bit more step as compared to what is being offered in Android. This makes the entire process slow for an Android User2. App Switcher: Apple could have easily made App Switcher easy with just light Swipe up, instead they made it with long pressed Swipe up. Why man, why.. You don't have any features for Swipe up, just make it easy to launch.3. Andorid Dialer is Always Missed: Every android has a basic feature, where you can search the contact directly from Phone Dialer, here Dialer is used for Dialing Number only and it will not suggest you similar contact from contacts or last Dial. This is really bad.. If you have to Dial a number directly, use Dialer.. If you have to dial someone from Recent Call log, shift to that and if you to dial someone from contact, shift to that. Man, all this can be done under one button, under dialer. Android user will miss this very badly.4. Sending Multiple Files in Whatsapp: If you wants to add more than 1 file directly from whatsapp, you have to do it twice. In Android, one can simple start selecting from whatspp itself and can select as many files as they wants and can send in a single click. Here for sending multiple files, you have to go to gallery or folder and select all files first and share it through whatsapp.5. No Swipe based shifting from Chats to Status and to calls: In Android Whatsapp, you can switch between Calls, Chats and Status by just swiping, here you have to press button of each.6. Contact Viewing: Contact list sorting method is still out of my mind. Man, make it easy. For example, if one of your contacts First Name or Middle Name or Last Name, any one of thing start with Alphabet \"A\", than it will be shown on top of the list. Apple, pls adopt any one method or at least allow us to customise it.7. Many Apps in Android are much more refined than its version on Apple.8. This is for those who had use Samsung Pay: Samsung Pay was one of the best app for making UPI or Card Payment, just swipe up from home screen of Samsung Phones (Only S Series) and the app is open for payment, I miss that here very badly.9. Lack of Dual Messenger Facility: You can't use two different WhatsApp numbers here in the same phone, as supported in all android right now.These are the issues that I face right now. Apart from this, the phone is good, the sound is loud and clear, it Feels Premium in Hand, the Touch is very good and Face ID works like a charm. Gesture control customization is really good and you can customize a lot of things."}, {"user": "SHUBHAM", "title": "Excellent Camera", "star_rating": "4.0 out of 5 stars", "date": "Reviewed in India on 29 October 2023", "message": "First thing first, checked if the product was original or not. For that, check the following1. If the screen has “True Tone” option.2. Check the Serial Number for “M” letter, indicates its new unit.3. Check if IMEI number of the product is same as mentioned on the box.4. Battery Health should be 100%.Pros:1. Camera is one of the best I have used so far.2. Haptic feedback is very great. I noticed it instantly.3. Battery optimisation is very good. It’s been more than a month and I have never charged it more than 85%. Still I get a days battery easily.4. OS. I have used Android before this. And change in OS was good change as well.Cons:Charge speed is slow. I only charge it when the battery % is around 20%. And it takes 1 to 1.5 hr to charge.Comments:I don’t play any games or do any heavy usage tasks on phone. It’s just daily tasks like social media, YouTube, etc."}, {"user": "Pavan", "title": "After usage of 10 days", "star_rating": "4.0 out of 5 stars", "date": "Reviewed in India on 21 October 2023", "message": "The iPhone 13 is a stellar device that excels in various aspects, making it a top choice for anyone in the market for a new smartphoneDesign (5/5):The iPhone 13 boasts a refined and stylish design. Its build quality is top-notch, with a Ceramic Shield front cover and a robust aluminum frame. The color options are attractive, and the device feels great in the hand.Display (5/5):The Super Retina XDR display is a true showstopper. The colors are vibrant, and the contrast is exceptional. With a peak brightness of 800 nits, it's easy to view content even in bright sunlight. HDR content looks stunning, making it perfect for multimedia enthusiasts.Performance (5/5):Thanks to the A15 Bionic chip, the iPhone 13 delivers remarkable performance. It handles everything from multitasking to intensive gaming with ease. Apps launch quickly, and you'll experience minimal lag. This phone is a powerhouse.Camera (5/5):The dual-camera system on the iPhone 13 captures stunning photos and videos. The Night mode improvements are impressive, and the Cinematic mode adds a creative touch to videos. Whether you're a pro or a casual photographer, this phone will not disappoint.Battery Life (4.5/5):The battery life is commendable, easily lasting a full day with moderate usage. The new A15 chip is energy-efficient, which helps extend usage time. Fast charging and wireless charging support are valuable additions.Overall, the iPhone 13 is a remarkable smartphone that combines style, performance, and functionality. It's an investment in quality, and its reliability and future-proof features make it worth every penny. Whether you're upgrading from an older iPhone or switching from another brand, the iPhone 13 will not disappoint."}, {"user": "debarghyo chaudhuri", "title": "Review after 1 week of usage", "star_rating": "4.0 out of 5 stars", "date": "Reviewed in India on 30 July 2022", "message": "Got it for 65K on Amazon prime day. So as a lifelong android user I have switched to IOS. So will be dividing this into the pros and negs:Product red 128GBPros:1) Received genuine product from Amazon( was quite sceptic about it though)2) Built quality excellent3) Camera quality excellent. True to life color reproduction, Indoor conditions amazing, night photos are good, facial tones are very good, day clicks are amazing. In short it's an amazing exp. Selfie cam also produces very good quality images. And also no shift in dynamic range while shifting B/W wide and ultra wide cams.4) Display:- Its a really great display, not 120 hz, but the experience is no less than a 120 hz, coz of apple's great software optimization, buttery smooth, no jitters on the screen, won't feel like a 60 hz panel. Now the notch, yes it will be bothering a little bit but its got its own functions, face unlock and stuff (works great in all environmental conditions)after a little while you get adjusted and it got its own magic functions like when when the phone rings and you go close to it, it detects your presence and lowers the vol level.5) Performance: Most powerful processor in the world.6) Battery:- With light usage will easily go for 2 days and with heavy 1 day. Remember to follow a charging pattern and it will give a solid battery exp.7) Speakers: Very loud with a small thumpCons:1) To keep photos and stuff you need to buy storage. 5 GB by default but that's nothing. Download google photos as an alternate sol. if you don't wanna buy storage.2) File management system sucks, android is much better.3) It has dolby atmos but for that you need a subscription to Apple music.4) Does not have a telephoto cam, which I think is a must at this price point.5) Somehow I am not getting 4g+ on my airtel, don't know why but in my android phone always used to get that.6) No USB C7) Siri is dumb AF8) Apple maps are not good, so download Google maps.9) Google keypad is much better than apple's.10) Notification panel and those small things like typing in the notification panel and other things that you can do in android is much much better than apple.11) As of now no haptic feedback while typing maybe coming on IOS 16Note:- Apple ecosystem still exploring that part but whenever you click any pic it automatically gets updated and I can see it in my Macbook also.Overall I would say if you are planning to buy a phone for responsiveness and does the everyday stuff without any hanging problems and stuff then buy it, and also if you are planning to keep it for a long time, then I think its a good investment for the future. Its got Great resale value.Hope this helps in making your decision easier.Update after 2 weeks of usage:All the above points remains the same, but I did check out the ecosystem and the experience has been amazing.1) I can receive and make phone calls (cellular calls) from my macbook, and the call quality is also good.So basically you can keep your phone in some other section of the house and you are working with your macbook somewhere else and if some call comes you can receive that on your macbook. PS:- your phone and macbook should be connected to a similar network, i.e wi-fi.2) Airplay- Just from the lock screen itself i can play any video and also listen to music from my phone. So basically you can watch youtube amazon prime videos(app not in the macbook but present on phone) and other stuff and also listen to music, and the switch of devices is also seamless. So someone in my house can use my macbook to watch movies on amazon prime(playing from my phone) and I can browse linkedin or FB from my iphone."}, {"user": "Nony", "title": "Got original product with worst packing", "star_rating": "4.0 out of 5 stars", "date": "Reviewed in India on 21 October 2023", "message": "Ok guys we get orginal productColour is red128 gbCharging cable is original as both code are matchingPacking was worst no bubble wrapDelivery assistance was very rudeDon't agree to shoot video of opening parcelAmazon is giving permission to do that but delivery agent was rejecting itKindly improve package wrap some bubble cover"}, {"user": "Dinesh", "title": "Nice phone with best battery", "star_rating": "5.0 out of 5 stars", "date": "Reviewed in India on 25 October 2023", "message": "Decent battery backup. Good pics. Battery comparison can be done with 4000 mah android. In android you can access everything seamlessly but not in case of IOS.Anyways, I made a decision to go for iPhone 13 instead of 14 coz it’s 10k grands lesser can easily compromise and adjust on 2gb extra Ram in 14. Apple devices doesn’t hang, unless you utilise entire ROM. Love iPhone 13"}, {"user": "Mohdhasan", "title": "Iphone is best but…", "star_rating": "4.0 out of 5 stars", "date": "Reviewed in India on 27 October 2023", "message": "Everything is perfect in iphone 13 except battery ..and amazon is cheating to customer by starting their sale before 12am in night.And they are not giving bank offer..they take my 3000 extra by this scam"}, {"user": "Kindle RJ", "title": "Genuine iPhone", "star_rating": "5.0 out of 5 stars", "date": "Reviewed in India on 29 October 2023", "message": "I have seen that many Amazon users have been skeptical about purchasing iPhone from Darshita ezone or Darshita electronics. After I ordered the product red iPhone 13 from Darshita ezone, because of these negative reviews, even I got scared. However, I didn't cancel my order and decided to wait. Though Amazon delivered the order little late than I expected, I have received a genuine iPhone 13 product red. I checked the model number and IMEI number. All are perfect. Have been using the phone for almost 3 weeks now. Even updated to iOS 17. It's a gem. No issues. No problem. Heating is understandable during charging. But that's already expected. Thumbs up to both Amazon and Darshita ezone. And do I need to write about iPhone 13? It's awesome already."}, {"user": "Nitish Kumar", "title": "I chosen an iPhone as my first smartphone!!", "star_rating": "4.0 out of 5 stars", "date": "Reviewed in India on 23 October 2023", "message": "I’ve been very satisfied with its performance. The device offers a seamless user experience, with a sleek design and a vibrant display. Its camera quality is impressive, capturing sharp and vivid photos. The battery life has been reliable for my daily usage, and the ecosystem of apps and services is a huge advantage. Overall, I highly recommend this iPhone for anyone looking for a premium smartphone experience and I’m thrilled with my decision to choose an iPhone as my first smartphone!!"}, {"user": "Swarup Raaj", "title": "Camera quality", "star_rating": "5.0 out of 5 stars", "date": "Reviewed in India on 16 October 2023", "message": "Image quality is awesome. All the camera lovers are gonna love it. Dynamic range is super awesome. No colour shift frim main and ultrawide camera. For me switching from android to iOS… it takes some time to adapt. But believe me, its a great experience.As i was having an iPad , so iphone combined gives me a great experience.The only con I found is the battery experience. Compared to the android phones at this price range… the battery is good… will last u for a day, but should be better ."}]