[{"user": "Keshav", "title": "Decent performance but a bit overpriced.", "star_rating": "4.0 out of 5 stars", "date": "Reviewed in India on 9 April 2023", "message": "Been running most games without any issues, mainly bought it for productivity, but nevertheless working fine as expected. For gaming, 3060ti 8GB is better, for rendering and graphics work this one is good enough. I feel the price is on the higher side considering current market prices. GDDR6 is quite fast and have paired it with 13700K which is being bottlenecked, better to go with intel 12/13 gen i5 600 series or Ryzen 5."}, {"user": "RAJU BABU SAKALI", "title": "GeForce RTX 3060", "star_rating": "5.0 out of 5 stars", "date": "Reviewed in India on 11 September 2022", "message": "Working fine..no problem arises in the installation let's see what it's working style.thanks"}, {"user": "Sanjay", "title": "Awesome speed. Rendered a video of 8min in just 2min.", "star_rating": "5.0 out of 5 stars", "date": "Reviewed in India on 22 February 2022", "message": "awesome speed with effortable price."}, {"user": "daubresse", "title": "N/A", "star_rating": "N/A", "date": "Reviewed in France on 22 April 2023", "message": "la livraison ,poser sur le mur de la cloture ,sans contre signature"}, {"user": "Joseph", "title": "N/A", "star_rating": "N/A", "date": "Reviewed in Germany on 15 August 2022", "message": "Amazing card can play any game you wish to play"}, {"user": "David", "title": "N/A", "star_rating": "N/A", "date": "Reviewed in the United States on 13 August 2023", "message": "This plays everything I throw at it in 1080p at at least 60fps with max settings and most titles are over 90fps. Some fps like rainbow six seige and cs go get 300+ fps. Paired with i5 12600k and 32gb of ddr5 6000mhz. When the fans spin up they make a rattle/growl noise not unlike an ancient hard drive of the 90s era. With auto fan settings when there is a light load or on and off loads it can get pretty annoying since my case fans are basically silent. This can be made better by making fans be spun up/always on from boot with a fan profile. Not sure if this is because of the plastic housing around the fans but wish it didn't happen in the first place."}, {"user": "JuztPro", "title": "N/A", "star_rating": "N/A", "date": "Reviewed in the United Kingdom on 29 December 2022", "message": "It was a bit overpriced when I bought it maybe I could’ve got a 3060 ti instead but it still runs smoothly on most games (fortnite,cod, god of war, minecraft, apex)I recommend using this with the Ryzen 5 or intel i5"}, {"user": "sean gallagher", "title": "N/A", "star_rating": "N/A", "date": "Reviewed in the United States on 9 October 2023", "message": "Using this card to video editing"}, {"user": "joshua w schoener", "title": "N/A", "star_rating": "N/A", "date": "Reviewed in the United States on 30 September 2023", "message": "This is a great mid level card. Huge upgrade from my 960 GTX ssc."}, {"user": "RiveCross", "title": "N/A", "star_rating": "N/A", "date": "Reviewed in Mexico on 18 August 2023", "message": "A pesar de que se atravesó el fin de semana, mi pedido llegó a tiempo y en excelentes condiciones."}]