[{"user": "Neeraj Verma", "title": "Energy Efficient & Well Designed 1.5 Ton Window AC", "date": "May, 2020", "review": "For the AC (JW-Q18WUXA1, 3-Star variant):\n\nPROS:\n1.cooling is good not the best. i live on top floor & my floor is exposed to sunlight from all four sides. i use it at 25 or 27 degree, Still this ac cools the house efficiently but if u r someone who uses the ac at 21 or less & want chill like feeling, go for the 5-star variant (may be that gives the chilling effect) bcoz it is not good for that much cooling or purchase it if you live on the floor that is not exposed to sunlight.\n2.it is also ..."}, {"user": "vishiwjeet singh", "title": "Brilliant", "date": "May, 2020", "review": "One of the best AC i bought. I need window AC due to rented accommodation. You can't imagine how energy efficient it is. Using it at 27-28 degree consumed only 4.5 units in 10 hours. Also it jas a very cute and beautiful design. Operation sound is very less. Cooling is awesome. Also airflow is best because of horizontal vent. Whole room cool down within 3-5 minutes."}, {"user": "Jagdeep Sharma", "title": "Nice", "date": "Jun, 2020", "review": "I want to point out following issues with this AC\n1. There is no auto swing provided for louvres. Paying a premium price for this window AC , I would expect this feature as this is normally present in all window units.\n2. Air outlet window is rather small for 1.5 ton unit.\n3. Please be aware that dimensions of this AC are smaller than a normal 1.5 ton AC. You might run into installation problems if your window opening is as per standard AC.."}, {"user": "Mohit Bhardwaj", "title": "Perfect product!", "date": "Mar, 2020", "review": "Best AC, Best Installation, but i can only buy extended warranty in 30days from the date of purchase that to at 2400 for another 1 year the warranty price is too high.\nEdit : The cooling is good but its way better if i can get instant cooling by the cool wave of air, so this AC is made to mount at sill level of window not attached at Lintel Level so the AC air can cool you directly at first as the air will come from top strip not as conventional side bars opening (You Understood it right!). ..."}, {"user": "Flipkart Customer", "title": "Super!", "date": "Jun, 2020", "review": "Very good, i can't believe about it's electricity consumption"}, {"user": "Sanjay Kumar", "title": "Just wow!", "date": "May, 2019", "review": "very much cool,😎"}, {"user": "Aqib Shariq", "title": "Wonderful", "date": "Jun, 2020", "review": "Good ac by LG"}, {"user": "Joseph Kumar", "title": "Delightful", "date": "Mar, 2022", "review": "Nice and perfect for extremly hot 🔥🥵 ..and very easy to use"}, {"user": "Ashwani Nigam", "title": "Nice", "date": "May, 2020", "review": "Cooling is decent but Most premium AC in LG range and still doesn't have following features which are available in normal AC -\n1. Air Swing not available. So you have air throw in one direction only.\n2. Remote neither have backlight nor have radium button, so you keep on guessing buttons and display in night.\n3. Doesn't have any option of fresh air intake, so only room air recirculate"}, {"user": "Suketu Mangukia", "title": "Terrific purchase", "date": "7 months ago", "review": "I am delighted with this LG 4-in-1 window AC unit! This air conditioner is not only stylish and attractive, but It is also super quiet, has super fast cooling capability, excellent build quality, and is incredibly economical on electricity. It is the perfect choice for anyone who wants a reliable, efficient, and high-quality Window AC unit.\n* I am writing again after 1 month of use:\nThis AC has a slinger fan. The slinger fan means that there's no need for water drainage or tubing, which make..."}, {"user": "Jefy Ouseph", "title": "Delightful", "date": "Feb, 2022", "review": "Excellent product and energy saver also..."}, {"user": "SUBRATA DAS", "title": "Perfect product!", "date": "5 months ago", "review": "Product was so good as well as installation was done very quickly by Flipkart. I am very happy with the service."}, {"user": "Kaushal Sharma", "title": "Bad quality", "date": "May, 2021", "review": "Ac is good in cooling and design but only drawback is it doesn’t have auto swing blades. Also installation service is really bad"}, {"user": "Abhishek Verma", "title": "Utterly Disappointed", "date": "5 months ago", "review": "Poor installation company that is Jeeves pvt ltd. Lacks professional experience don't know how to install ac properly .\nAlso customer support is giving improper service and can't convey simple instructions to the service team."}, {"user": "Mohammad Asif", "title": "Useless product", "date": "5 months ago", "review": "Pathetic service from illiterate Jeeves service staff, they dragged AC on the floor, while fitting the AC they did not fit it back with screws. Glued foam on the AC cabinet to cover the gap, which itself is extremely hard to clean before doing the permanent gap filing within the window."}, {"user": "Flipkart Customer", "title": "Worth every penny", "date": "7 months ago", "review": "Awesome product by LG\nREALLY LIFE 👍 GOOD"}, {"user": "Lingeshwaran Shanmugasundaram", "title": "Awesome", "date": "Mar, 2020", "review": "Futuristic design\nSmall size than regular 1.5 ton, so needed window modifications.\nPowerful cooling.\nNormal noise of a typical window ac.\nPricey though."}, {"user": "AVISHEK SHARMA", "title": "Simply awesome", "date": "Apr, 2022", "review": "Its a super product.. king of ACs available in the market. Very energy efficient and less noisy. You can blindly trust Lg and their double inverter technology. Go for it."}, {"user": "Abhijeet Singh", "title": "Excellent", "date": "Jun, 2020", "review": "Very good product and energy saver.much reduce electric bill."}, {"user": "PRAVEEN KHATRI", "title": "Great product", "date": "6 months ago", "review": "LG product is always great. This Ac cooling is good. Nice Looking design. Features loaded. It is a good buy in this segment"}, {"user": "rajan kumar", "title": "Super!", "date": "6 months ago", "review": "I like this AC😃"}, {"user": "Anuj Luthra", "title": "Highly recommended", "date": "May, 2020", "review": "It's been 2 months that I have purchased this AC. Best one if you want to save your electricity bill."}, {"user": "Parth Chhabra", "title": "Simply awesome", "date": "Oct, 2020", "review": "Delivered on October 19, Installation done on 20th. Absolutely amazing service by Flipkart.\n\nAC is good, electricity consumption is very less if you use it above 25-26.\nWiFi feature is luxury when you bought and necessary when you have. LG Thinkq app works great with the AC."}, {"user": "Rajat Gautam", "title": "Terrible product", "date": "May, 2021", "review": "I am using it from 1 week in expectation today it'll make room cool. I would have given it 0 star if option is available. I swear don't buy it. It is functioning like a cooler, only giving cool air in front of it not maintaining the room temperature. Even It's manager tried to deceive me by saying it'll maintain 25C-26C if I put it on 16C. Now think about what happen if you set 25C. It also don't have radium in it's remote button neither light in remote display so it's making impossible to ch..."}, {"user": "Sarita Jain", "title": "Worth every penny", "date": "6 months ago", "review": "This A.C looks so different from other window A. Cs.\nAmazing cooling."}, {"user": "suneel patel", "title": "Awesome", "date": "May, 2020", "review": "Cooling is awesome , design is very stylish and don't make much noise"}, {"user": "Flipkart Customer", "title": "Perfect product!", "date": "6 months ago", "review": "Good Design and Noise also very less. Happy to keep it. Only have doubt on energy efficiency"}, {"user": "Ajit Kumar", "title": "Brilliant", "date": "Oct, 2021", "review": "Awesome Windows AC By LG& Smart Look👌☺️ Cooling within 1 minute ❄️☃️, electric consumption less compair to another AC brand , no WiFi, no auto spin, Quick delivery by Flipkart within one day and next day Jeeves Installation team came and installation very well,"}, {"user": "Anurag Patel", "title": "Excellent", "date": "Mar, 2022", "review": "New Ac"}, {"user": "Flipkart Customer", "title": "Wonderful", "date": "Feb, 2021", "review": "Nice products lg windows ac"}]