[{"user": "NIKHIL SINGH", "title": "Terrible product", "date": "5 months ago", "review": "Waste of money . AC not working till one month of installation. Installed by Jeeves company authorized from LG but both are blaming on one another\nI request not to purchase from flipkart\nAs it lie there as waste of money\nJunk"}, {"user": "Flipkart Customer", "title": "Useless product", "date": "6 months ago", "review": "I purchased this LG A. C. on 17 April 23..The most horrible experience ever... My A. C. Is just not working... Even if I run it on 16 the room is hot.. I don't understand what is it .. I have an IFB ac in my hometown. It's 3 years old.. I have to wear a blanket even if I put it on 27 degree C..\nBut this LG AC.. I get a feeling that iv been fooled.. I'm a very nice guy.. Normally i never complain of things... But this time the experience has been really disastrous... I have problem when it ge..."}, {"user": "Raj Rout", "title": "Perfect product!", "date": "May, 2022", "review": "Honest review after using 30days.\n\nPros :\n1. Energy efficiency ( convertible moods)\n2. Slim Design ( Pure white)\n3. Self Diagnosis\n4. Sufficient grooved copper pipes\n5. Water discharge pipe also well enough according to 10\" Wall.\n6. Lowest noise\n7. High capacity ❄ cooling feature is good.\n8. Outdoor unit is bulky and lower noise too ( 33kg )\n9. Well finished design by LG\n10. Very smoothly working in 125sqrft room size.\n\nCons :\n1. Cooling quality according to Hitachi , you never find. ..."}, {"user": "Gyana Ranjan Kar", "title": "Must buy!", "date": "7 months ago", "review": "Cooling is good and it's Virat Mode (HC) is awesome, cools very fast. I would like to share brief review regarding this. Kindly read full for brief info.\n1st Pros-\n1. 5in1 Convertible\n2. Virat Mode\n3. Pure Copper Coiling with Supreme company Insulation on out pipe.\n4. Energy efficient\n2nd Cons-\n1. Kindly don't go with given Service installation provided by in cart if you are not in a city area, kindly after product deliver call Brand Customer service for installation at same price for best..."}, {"user": "syed irfan", "title": "Highly recommended", "date": "Oct, 2022", "review": "No noice completely and cooling was awesome"}, {"user": "ISMAIL Sheikh", "title": "Very Good", "date": "Apr, 2022", "review": "Good 👍😊"}, {"user": "Kamlesh Jangid", "title": "Worth the money", "date": "Mar, 2020", "review": "Great AC with great features at great price. Installation was done within promised timeframe. And done nicely.\n\nIn the test run, AC started throwing cool air in a minute. Very silent operation. Hope it works like this always. I trust LG on this."}, {"user": "Flipkart Customer", "title": "Terrific", "date": "Mar, 2022", "review": "1.Fan speed is very fast\n2.Cooling decent enough\n3.Latest features are very smart\n4. 4 swing mode is awesome... literally moves both outside and inside waver\n5. Flow of air is just like boom😅very fast\n6.compressor like quit noiceless 😮😮very silently move compressor becouse of dual inverter\n7.Ai motion is very smart"}, {"user": "Rajesh kumar Mahalaxmi", "title": "Mind-blowing purchase", "date": "Apr, 2022", "review": "Very Good A.C. Electric saver mode is amazing...I am happy... Thanks Flipkart."}, {"user": "Mayank Soni", "title": "Very poor", "date": "Apr, 2022", "review": "Did not received installation team on scheduled date. Not good you can get better options available in other apps.\nAlso in my case I had to cancel their installation schedule service at the end after wasting lot of days in reaching them out."}, {"user": "Aman", "title": "Worth every penny", "date": "May, 2022", "review": "Elegant design, Energy efficient and best part of it is 6in 1 convertible option which save energy a lot , With 6 hours of continuous running consumed just 3 units. Sleep mode of it works fine with adjusting accordingly with room temperature at night.Noise is minimal unlike other ACs which throw a lot of noise while running.\nWithout any thought go for it."}, {"user": "Srinivasa Rao Yalamanchili", "title": "Pretty good", "date": "7 months ago", "review": "Excellent 👌"}, {"user": "Ravikumar Sonwane", "title": "Just wow!", "date": "Apr, 2022", "review": "Good Ac .. Awesome Cooling.... Delivery on time .. Installation Good.., Overall Is Good..Tq Flipkart..@"}, {"user": "Saurabh Bhardwaj", "title": "Wonderful", "date": "Jul, 2020", "review": "I bought this AC on 16th June. I'm happy with the cooling, design of ac is good, service is fine however I didn't like the installation, it could be better. Though its was done on the same day of delivery.\nFeatures are really good. I recommend to buy this."}, {"user": "DINESH Kumar", "title": "Brilliant", "date": "Jun, 2020", "review": "Excellent cooling and different mode of work but only heating function not available. Installation charge are extra it may be 999 or 1599 depending on available offer.Excellent think is made in India I have proud for using this project."}, {"user": "K Amaresh Achary", "title": "Could be way better", "date": "Apr, 2022", "review": "Pros : Cooling is good, Super silent which was enough for my smaller room(120sqft.)\nAt night even 40% efficiency at 25 deg is enough.\n\nCons : Smaller ac as compared to other 1.5ton acs.\nCooling capacity is 4600 as compared to >5000 in others. So overall tonnage should be around 1.3-1.4\n2 way swing only.\nFin movement is limited to only 45 degree towards up. It doesnt cover rest 45 degree downwards(my major concern - as bed is right below the ac and I dont get ac air flow.)\nInstallation price t..."}, {"user": "LINEESH RAJ B P", "title": "Excellent", "date": "Feb, 2022", "review": "Very good"}, {"user": "Ebin Mathew Ninan", "title": "Brilliant", "date": "Apr, 2022", "review": "My Search for 5star 1 ton ended up here. Happy for my purchase. Good cooling.\nI was worried about the negative comments about the installation but my agents were professional and well mannered. Happy for the purchase. Go for it without a second thought and you will not regret. Will update about energy consumption after a week"}, {"user": "M Satheesh Kumar", "title": "Simply awesome", "date": "May, 2022", "review": "Good ,Less sound ,Cooling ok will share full review later ."}, {"user": "Rajesh Singamneni", "title": "Don't waste your money", "date": "Apr, 2022", "review": "Worst service I had ever seen.\nI have given the complaint regarding installation they didn't even respond. Don't buy AC in Flipkart. Product also not good it's damaged."}, {"user": "Riju", "title": "Excellent", "date": "7 months ago", "review": "This AC comes with 1480 w Power and 5150 w maximum Cooling Capacity, Rated CC 4340\nOn high Cool mode It consumes 1700W power. Cooling is decent. If we run night 7 hours it consumes 2.5 units at 26 temp.\nI got a good offfer from Flipkart one day and got at reasonable price in 9 month No Cost EMI. using this in 160sq ft room and the cooling is good. The quality of LG AC unit is good .\nInstallation by LG Service was very good and Fast within 4 hours.Cost 1415 + 855 stand. U can Go for it"}, {"user": "Jagmeet Singh Jakhar", "title": "Don't waste your money", "date": "May, 2022", "review": "Totally waste of money. company is not refund my money as per their policy which was not mentioned during purchase. That is why i am not using this and i have put it in the store room. thanks Flipkart 🙏🙏🙏"}, {"user": "SRINIVAS BALASANI", "title": "Terrific purchase", "date": "Mar, 2022", "review": "Good features"}, {"user": "SANJEEV KUMAR", "title": "Worthless", "date": "6 months ago", "review": "If you want to buy a white showpiece for your bedroom then go ahead otherwise BIG NO. Worst service experience. Flipkart would not accept return/exchange if you need to. The indoor unit has serious water leakage issues, so this showpiece can be used as bedside shower."}, {"user": "Flipkart Customer", "title": "Wonderful", "date": "Jun, 2020", "review": "5stars for delivery and good packing received delivery yesterday and installation done by today installation done by lg staff was very good and there are very pollite people AC cooling was excellent I'm very happy with this product😍😍😍"}, {"user": "Gaurishankar Sakhare", "title": "Brilliant", "date": "Mar, 2022", "review": "Simply Awesome Product..The delivery was flawless and right on time....The installation was really smooth and dustfree..The installation guy was very friendly and brilliant and accomodating..and did the installation better than expected..I would recommend this LG air conditioner and Flipkart for delivery and Installation...Best Combination."}, {"user": "malkeet singh", "title": "Moderate", "date": "May, 2022", "review": "my ac is installed yesterday from lg brand authorised engineer , i dont accept jeeves installation because if i install this ac from jeeves then i dont get 5 years warranty on mcb ,room temperature is not going below 26 degree if outside temperature is more than 39 degree , also the remote button of room temperature is not accurate , if my room temperature is 26 the remote update it after 1-2 hours"}, {"user": "Siddhartha Sankar", "title": "Best in the market!", "date": "Apr, 2022", "review": "Nice and efficient AC. It Cools 100+ sqft within 5 min. Very silent also. No other manufacturers are providing warranty on PCB. No doubt best AC in the market.\nNo light and glowing buttons in remote is a drawback. Jeeves service is not good.\nI got it installed from LG directly. I'll suggest to book installation request through LG customer care itself."}, {"user": "harsha vardhan varma potturi", "title": "Good choice", "date": "Jun, 2020", "review": "everything is good, except size of indoor & outdoor unit is looks like 1ton."}, {"user": "Lukman vailathur", "title": "Good quality product", "date": "Jan, 2021", "review": "Nice"}]